package by.jonline.lacture01.main;

/** Составить программу сравнения двух чисел 1 и 2. Если 1 меньш 2 - вывести на экран 
 * слово "yes", в противном случае - слово "no". 
 */
public class Main2 {

	public static void main(String[] args) {
		int x1 = 17;
		int x2 = 22;

		if (x1 < x2)
			System.out.print("yes");
		else
			System.out.print("no");

	}

}
